console.log('- Реализован интерфейс игры (+5); \n - В футере приложения есть ссылка на гитхаб автора приложения, год создания приложения, логотип курса со ссылкой на курс (+5); \n - При кликах по игровому полю по очереди отображаются крестики и нолики. Первая фигура всегда крестик (+10); \n - Игра завершается, когда три фигуры выстроились в ряд по вертикали, горизонтали или диагонали (+10); \n - По окончанию игры выводится её результат - выигравшая фигура и количество ходов от начала игры до её завершения (+10); \n - Результаты последних 10 игр сохраняются в local storage. Есть таблица рекордов, в которой отображаются результаты предыдущих 10 игр (+10); \n - Звук по окончании игры, который можно отключить, дополнительно - пользовательская настройка звука сохраняется в localStorage и учитывается при перезагрузке (+10); \n TOTAL: 60');





